# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/completions'
tap 'homebrew/binary'
tap 'alexandregz/MXhomebrew'
tap 'alehouse/homebrew-unofficial'
tap 'argon/mas'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install `wget` with IRI support
brew 'wget', args: ['with-iri']

# Install curl
brew 'curl', args: ['with-openssl']

# Install GNU tool
brew 'findutils', args: ['with-default-names']
brew 'coreutils'
brew 'moreutils'
brew 'binutils'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-getopt', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/diffutils'
brew 'homebrew/dupes/nano', args: ['disable-nls', 'enable-color', 'enable-extra', 'enable-multibuffer', 'enable-nanorc', 'enable-utf8']
brew 'python'

# Install bash completions
brew 'vagrant-completion'
brew 'bash-completion'
brew 'bash-git-prompt'

# Install media tools
brew 'ffmpeg'

# Install other tools
brew 'ed', args: ['with-default-names']
brew 'wdiff', args: ['with-gettext']
brew 'httpie'
brew 'gist'
brew 'asciinema'
brew 'homebrew/binary/ngrok2'
brew 'hub'
brew 'tree'
brew 'node'
brew 'terminal-notifier'
brew 'wget'
brew 'dnsmasq'
brew 'readline'
brew 'ccat'
brew 'gnutls'
brew 'gawk'
brew 'sqlite'
brew 'osquery'
brew 'htop-osx'
brew 'diff-so-fancy'
brew 'ack'
brew 'gzip'
brew 'watch'
brew 'git'
brew 'git-lfs'
brew 'git-fresh'
brew 'git-extras'
brew 'git-flow'
brew 'tig'
brew 'less'
brew 'openssh'
brew 'rsync'
brew 'unzip'
brew 'mycli'
brew 'pgcli'
brew 'bashmarks'
brew 'mas'

# Apps
cask 'changes'
cask 'cleanmymac'
# cask 'cocktail' # Currently a 404
cask 'dockertoolbox'
cask 'dropshare'
cask 'flame'
cask 'flux'
cask 'houdahgeo'
case 'garmin-express'
case 'garmin-virb-edit'
cask 'gitter'
cask 'imageoptim'
cask 'iterm2-beta'
cask 'macdown'
cask 'near-lock'
cask 'onyx'
cask 'sequel-pro'
cask 'sourcetree'
cask 'sublime-text3'
# cask 'things' # Version in cask is so ridiculously out of date
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'vagrant-manager'
cask 'versions'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'vlc'
cask 'undercover'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'qlimagesize'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
